{
  "model_config": {
    "name": "sequential_1",
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            96
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_2"
        },
        "registered_name": null
      },
      {
        "module": "cnn2snn.quantization_layers",
        "class_name": "QuantizedDense",
        "config": {
          "name": "proj_in",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantizer": {
            "module": "cnn2snn.quantization_ops",
            "class_name": "MaxPerAxisQuantizer",
            "config": {
              "name": "max_per_axis_quantizer",
              "trainable": true,
              "dtype": "float32",
              "bitwidth": 8
            },
            "registered_name": "MaxPerAxisQuantizer"
          }
        },
        "registered_name": "QuantizedDense",
        "build_config": {
          "input_shape": [
            null,
            96
          ]
        }
      },
      {
        "module": "cnn2snn.quantization_layers",
        "class_name": "QuantizedReLU",
        "config": {
          "name": "gate_relu6",
          "trainable": true,
          "dtype": "float32",
          "bitwidth": 4,
          "max_value": 6.0
        },
        "registered_name": "QuantizedReLU",
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      },
      {
        "module": "cnn2snn.quantization_layers",
        "class_name": "QuantizedDense",
        "config": {
          "name": "mix_dense",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantizer": {
            "module": "cnn2snn.quantization_ops",
            "class_name": "MaxPerAxisQuantizer",
            "config": {
              "name": "max_per_axis_quantizer_1",
              "trainable": true,
              "dtype": "float32",
              "bitwidth": 4
            },
            "registered_name": "MaxPerAxisQuantizer"
          }
        },
        "registered_name": "QuantizedDense",
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        }
      },
      {
        "module": "cnn2snn.quantization_layers",
        "class_name": "QuantizedReLU",
        "config": {
          "name": "post_relu6",
          "trainable": true,
          "dtype": "float32",
          "bitwidth": 4,
          "max_value": 6.0
        },
        "registered_name": "QuantizedReLU",
        "build_config": {
          "input_shape": [
            null,
            32
          ]
        }
      },
      {
        "module": "cnn2snn.quantization_layers",
        "class_name": "QuantizedDense",
        "config": {
          "name": "proj_out",
          "trainable": true,
          "dtype": "float32",
          "units": 16,
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantizer": {
            "module": "cnn2snn.quantization_ops",
            "class_name": "MaxPerAxisQuantizer",
            "config": {
              "name": "max_per_axis_quantizer_2",
              "trainable": true,
              "dtype": "float32",
              "bitwidth": 4
            },
            "registered_name": "MaxPerAxisQuantizer"
          }
        },
        "registered_name": "QuantizedDense",
        "build_config": {
          "input_shape": [
            null,
            32
          ]
        }
      }
    ]
  },
  "layers": [
    {
      "name": "proj_in",
      "type": "QuantizedDense",
      "config": {
        "name": "proj_in",
        "trainable": true,
        "dtype": "float32",
        "units": 64,
        "use_bias": false,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "quantizer": {
          "module": "cnn2snn.quantization_ops",
          "class_name": "MaxPerAxisQuantizer",
          "config": {
            "name": "max_per_axis_quantizer",
            "trainable": true,
            "dtype": "float32",
            "bitwidth": 8
          },
          "registered_name": "MaxPerAxisQuantizer"
        }
      },
      "attrs": {
        "get_config": {
          "name": "proj_in",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "use_bias": false,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "quantizer": {
            "module": "cnn2snn.quantization_ops",
            "class_name": "MaxPerAxisQuantizer",
            "config": {
              "name": "max_per_axis_quantizer",
              "trainable": true,
              "dtype": "float32",
              "bitwidth": 8
            },
            "registered_name": "MaxPerAxisQuantizer"
          }
        },
        "get_weights": [
          [
            [
              -0.032733336091041565,
              -0.04173114895820618,
              0.046255484223365784,
              0.03642427921295166,
              0.19161608815193176,
              -0.04709331691265106,
              -0.005941048264503479,
              0.16167813539505005,
              -0.11016902327537537,
              0.09011143445968628,
              0.07769760489463806,
              0.09789207577705383,
              -0.07228168100118637,
              0.08602488040924072,
              -0.06459343433380127,
              0.13738778233528137,
              -0.04930327832698822,
              -0.174891859292984,
              -0.182887002825737,
              -0.07849231362342834,
              -0.15738649666309357,
              -0.08313941955566406,
              0.08655273914337158,
              -0.08669978380203247,
              -0.05606471002101898,
              0.09398496150970459,
              -0.09380043298006058,
              0.1530466079711914,
              -0.08624833822250366,
              -0.17845158278942108,
              -0.13770921528339386,
              0.052876248955726624,
              0.15277180075645447,
              -0.17907682061195374,
              0.09468242526054382,
              0.15889155864715576,
              -0.10045753419399261,
              -0.07733235508203506,
              0.1736612617969513,
              -0.16202887892723083,
              0.07934871315956116,
              0.1612449288368225,
              -0.1608617603778839,
              -0.08508403599262238,
              -0.14492015540599823,
              -0.1534116566181183,
              0.08352017402648926,
              -0.13582715392112732,
              -0.011104419827461243,
              0.021112099289894104,
              0.10264459252357483,
              0.18498611450195312,
              0.09542888402938843,
              -0.010695129632949829,
              -0.11871246993541718,
              0.18004149198532104,
              0.08578610420227051,
              -0.18685993552207947,
              0.07628625631332397,
              -0.16381403803825378,
              -0.11084018647670746,
              0.17596545815467834,
              -0.10206395387649536,
              0.13199380040168762
            ],
            [
              -0.08042307943105698,
              0.1237504780292511,
              0.03312744200229645,
              -0.14616507291793823,
              -0.14326894283294678,
              -0.12215583771467209,
              -0.09895581752061844,
              -0.004821956157684326,
              -0.13651184737682343,
              0.12836864590644836,
              -0.12859177589416504,
              -0.15244174003601074,
              0.028337717056274414,
              0.1691775918006897,
              -0.05252452194690704,
              -0.1695663034915924,
              0.1627483069896698,
              -0.07633596658706665,
              0.14756351709365845,
              0.12189525365829468,
              0.046182528138160706,
              0.007851913571357727,
              -0.022097542881965637,
              -0.09376783668994904,
              0.16098010540008545,
              -0.021156594157218933,
              0.10771417617797852,
              0.049102336168289185,
              -0.140207901597023,
              0.10788464546203613,
              -0.14093813300132751,
              -0.11142478883266449,
              0.18119192123413086,
              -0.0842282846570015,
              -0.14546185731887817,
              -0.04447241127490997,
              -0.15318745374679565,
              0.07544100284576416,
              -0.055022627115249634,
              0.13081753253936768,
              0.08742335438728333,
              -0.08515093475580215,
              -0.18056148290634155,
              0.037218064069747925,
              0.04956062138080597,
              0.15713661909103394,
              -0.10722926259040833,
              0.06192275881767273,
              -0.058367788791656494,
              -0.14156095683574677,
              0.01457776129245758,
              -0.02473464608192444,
              -0.1313822716474533,
              0.18532174825668335,
              -0.011626839637756348,
              -0.17474699020385742,
              -0.19284725189208984,
              0.04443773627281189,
              -0.046658918261528015,
              0.0001859217882156372,
              -0.18818001449108124,
              -0.12477259337902069,
              -0.07841683179140091,
              0.002575203776359558
            ],
            [
              0.03831528127193451,
              -0.02093254029750824,
              -0.12110450863838196,
              0.07726314663887024,
              0.004918813705444336,
              0.1532725989818573,
              -0.03577388823032379,
              -0.009695753455162048,
              0.1361304521560669,
              -0.04918240010738373,
              0.03223443031311035,
              0.07520103454589844,
              0.04979567229747772,
              0.06048664450645447,
              -0.04736092686653137,
              -0.17111782729625702,
              -0.024289757013320923,
              -0.15479397773742676,
              0.050249844789505005,
              -0.09055490046739578,
              -0.014070779085159302,
              0.011581674218177795,
              -0.08999297022819519,
              0.1685510277748108,
              0.002868562936782837,
              -0.18219953775405884,
              0.05245347321033478,
              0.07560989260673523,
              -0.07644123584032059,
              -0.0950952097773552,
              -0.14170648157596588,
              0.034650251269340515,
              0.024680301547050476,
              0.048985302448272705,
              -0.193284809589386,
              -0.16399843990802765,
              0.14872494339942932,
              0.12994682788848877,
              0.16445791721343994,
              -0.12705212831497192,
              0.1410163938999176,
              0.07550957798957825,
              -0.05540984869003296,
              0.04252026975154877,
              0.17450666427612305,
              0.1407662034034729,
              0.013598412275314331,
              0.1635807454586029,
              0.06343793869018555,
              -0.005964592099189758,
              0.013046219944953918,
              -0.047141194343566895,
              0.13243919610977173,
              -0.15065418183803558,
              -0.04216662049293518,
              0.05373513698577881,
              -0.015467360615730286,
              0.03080935776233673,
              -0.15264298021793365,
              0.014404252171516418,
              0.11639222502708435,
              0.05290102958679199,
              0.08526253700256348,
              -0.17184624075889587
            ],
            [
              0.0429011732339859,
              0.15773946046829224,
              0.18714338541030884,
              0.04936620593070984,
              0.15304183959960938,
              0.013674870133399963,
              -0.03650073707103729,
              -0.02787727117538452,
              0.11702045798301697,
              0.041545405983924866,
              -0.08581411838531494,
              0.0005203783512115479,
              0.06333452463150024,
              -0.06972097605466843,
              -0.08130957931280136,
              -0.04068845510482788,
              0.028364866971969604,
              -0.18259912729263306,
              -0.12386517226696014,
              0.10338985919952393,
              0.13965880870819092,
              0.15903598070144653,
              -0.025509968400001526,
              0.07632997632026672,
              0.1330741047859192,
              -0.0056045204401016235,
              0.08957096934318542,
              -0.07822789996862411,
              0.03340473771095276,
              -0.1871057003736496,
              -0.11050660908222198,
              0.08068892359733582,
              0.035896554589271545,
              -0.08404314517974854,
              -0.14896567165851593,
              -0.1287229061126709,
              -0.0619795024394989,
              0.039407700300216675,
              -0.18315400183200836,
              0.132371723651886,
              -0.029529914259910583,
              -0.003462493419647217,
              -0.14044189453125,
              -0.08154874294996262,
              0.02572678029537201,
              0.09510549902915955,
              0.10558396577835083,
              0.13857054710388184,
              0.024712353944778442,
              0.1812923550605774,
              0.017741024494171143,
              -0.14765404164791107,
              0.1378595232963562,
              -0.18631421029567719,
              0.14767393469810486,
              -0.17210373282432556,
              -0.00293615460395813,
              -0.17946219444274902,
              0.09604811668395996,
              0.19050058722496033,
              -0.09495333582162857,
              -0.12852364778518677,
              0.06850233674049377,
              0.013826817274093628
            ],
            [
              -0.1587042659521103,
              0.0015663951635360718,
              0.12964850664138794,
              0.06497073173522949,
              -0.07071875035762787,
              -0.1310383528470993,
              0.0752066969871521,
              -0.1427515298128128,
              0.04914413392543793,
              -0.10735572129487991,
              0.050416335463523865,
              -0.11630504578351974,
              0.1463560163974762,
              0.10213425755500793,
              0.03212593495845795,
              0.10615336894989014,
              0.08213591575622559,
              -0.011092886328697205,
              -0.036314576864242554,
              -0.017495721578598022,
              0.13809549808502197,
              -0.16873160004615784,
              0.01592230796813965,
              0.05651324987411499,
              0.016997739672660828,
              0.04863801598548889,
              -0.13099339604377747,
              -0.006230220198631287,
              -0.09026218205690384,
              -0.06796237826347351,
              -0.007139384746551514,
              0.012439742684364319,
              0.046400681138038635,
              0.16415584087371826,
              -0.05200055241584778,
              -0.12078871577978134,
              0.1285056173801422,
              -0.17112599313259125,
              -0.1572660356760025,
              -0.01639735698699951,
              0.06703966856002808,
              0.12324774265289307,
              0.09412196278572083,
              0.009214013814926147,
              0.12679606676101685,
              -0.17194975912570953,
              -0.0544857531785965,
              0.14245113730430603,
              -0.12891894578933716,
              0.1758614182472229,
              -0.1302783489227295,
              -0.12259311228990555,
              0.19122454524040222,
              -0.028594881296157837,
              0.040536001324653625,
              0.12961351871490479,
              0.10262468457221985,
              0.150633305311203,
              -0.06826506555080414,
              0.07967263460159302,
              -0.13980433344841003,
              -0.001674056053161621,
              -0.18519479036331177,
              0.038147374987602234
            ],
            [
              0.15479332208633423,
              -0.02023717761039734,
              -0.1636592298746109,
              0.08986213803291321,
              0.047569602727890015,
              -0.10397588461637497,
              0.13154128193855286,
              -0.06132499873638153,
              -0.1162450760602951,
              -0.03386610746383667,
              0.07394114136695862,
              -0.17448067665100098,
              -0.1488918960094452,
              0.02914319932460785,
              0.023545175790786743,
              0.16325131058692932,
              0.1419098973274231,
              -0.015624195337295532,
              0.06605759263038635,
              -0.02592618763446808,
              0.07796967029571533,
              -0.08202964067459106,
              0.00841490924358368,
              -0.126573383808136,
              -0.03273855149745941,
              0.08130091428756714,
              0.138042151927948,
              -0.1531444787979126,
              -0.11057212948799133,
              -0.07465442270040512,
              -0.051303476095199585,
              -0.14327028393745422,
              -0.017900079488754272,
              -0.01359209418296814,
              0.14007294178009033,
              -0.036172643303871155,
              -0.055449455976486206,
              0.10149210691452026,
              -0.03513018786907196,
              0.17852604389190674,
              -0.16778156161308289,
              -0.07114849239587784,
              0.13736611604690552,
              0.03977520763874054,
              0.1403479278087616,
              -0.15460024774074554,
              0.060268551111221313,
              -0.1818929761648178,
              0.03084680438041687,
              -0.06390291452407837,
              0.04327763617038727,
              -0.16531255841255188,
              -0.055743828415870667,
              0.008173450827598572,
              -0.05569753050804138,
              -0.12259634584188461,
              0.17446249723434448,
              0.1503623127937317,
              0.14746996760368347,
              -0.009951621294021606,
              -0.10633298009634018,
              0.12355169653892517,
              -0.0870344266295433,
              0.19016596674919128
            ],
            [
              -0.13651613891124725,
              -0.18182463943958282,
              0.015414312481880188,
              0.18081727623939514,
              0.06141096353530884,
              0.07501986622810364,
              0.021955981850624084,
              -0.022996962070465088,
              0.12689390778541565,
              -0.15778234601020813,
              -0.14760875701904297,
              -0.188362717628479,
              0.0979669988155365,
              0.133905291557312,
              -0.14444118738174438,
              0.13048624992370605,
              -0.13242197036743164,
              -0.17175514996051788,
              -0.07318493723869324,
              0.14473918080329895,
              0.18582335114479065,
              -0.10199686884880066,
              0.1935155987739563,
              0.031159743666648865,
              0.15346744656562805,
              0.15405583381652832,
              -0.020808160305023193,
              -0.08696623146533966,
              0.16821250319480896,
              0.01540406048297882,
              0.1081981360912323,
              0.04614837467670441,
              0.15036427974700928,
              -0.08719033747911453,
              0.18221145868301392,
              0.05084921419620514,
              -0.051065102219581604,
              -0.008392468094825745,
              0.06778216361999512,
              0.18500596284866333,
              0.1890563666820526,
              -0.025754854083061218,
              0.06765764951705933,
              0.0487380176782608,
              0.09315317869186401,
              0.045194417238235474,
              -0.11193477362394333,
              -0.144660085439682,
              -0.04145453870296478,
              -0.08817785978317261,
              -0.017160490155220032,
              0.11661222577095032,
              0.06438413262367249,
              0.02286796271800995,
              -0.17443880438804626,
              0.1653251051902771,
              0.005744457244873047,
              0.019849315285682678,
              -0.16533643007278442,
              -0.006882950663566589,
              -0.15437503159046173,
              0.08934605121612549,
              0.03104931116104126,
              0.1781541109085083
            ],
            [
              0.024737879633903503,
              -0.17518647015094757,
              -0.16486938297748566,
              0.04707410931587219,
              -0.10492438822984695,
              0.006173476576805115,
              -0.013193413615226746,
              0.07689973711967468,
              -0.17418168485164642,
              -0.03180815279483795,
              0.04784408211708069,
              -0.08407717198133469,
              -0.17303575575351715,
              -0.11436010897159576,
              0.006250530481338501,
              0.039540305733680725,
              0.17922648787498474,
              -0.17692360281944275,
              -0.08588849753141403,
              0.17124685645103455,
              -0.09780527651309967,
              0.12433472275733948,
              -0.16128048300743103,
              0.11458519101142883,
              0.032640352845191956,
              0.16717761754989624,
              -0.19327838718891144,
              0.09774604439735413,
              0.05120393633842468,
              -0.1574769914150238,
              -0.1504649817943573,
              -0.1588442027568817,
              -0.01232445240020752,
              0.14727452397346497,
              0.03858441114425659,
              0.03344564139842987,
              0.012845486402511597,
              0.1771610975265503,
              0.08880972862243652,
              -0.1424311101436615,
              0.05244968831539154,
              0.004290670156478882,
              -0.12397076189517975,
              -0.13115963339805603,
              0.1119219958782196,
              0.16872724890708923,
              0.036413609981536865,
              0.09515509009361267,
              0.07840344309806824,
              -0.014068841934204102,
              -0.04449082911014557,
              -0.11003457754850388,
              -0.16510996222496033,
              0.022080227732658386,
              -0.08559489995241165,
              -0.17099842429161072,
              0.03438708186149597,
              0.11497041583061218,
              -0.10050512850284576,
              0.008954495191574097,
              0.05417254567146301,
              -0.0774005874991417,
              -0.01155698299407959,
              -0.1644754558801651
            ],
            [
              -0.05854766070842743,
              0.03797982633113861,
              -0.10239619016647339,
              0.17302125692367554,
              -0.17498452961444855,
              -0.006511524319648743,
              -0.10186505317687988,
              0.10723015666007996,
              -0.14233240485191345,
              -0.05968472361564636,
              0.04479362070560455,
              -0.14859963953495026,
              0.07191473245620728,
              0.006313920021057129,
              -0.18615968525409698,
              -0.03466387093067169,
              0.089968740940094,
              -0.1318432241678238,
              0.02188432216644287,
              -0.07542767375707626,
              0.07370850443840027,
              -0.08169717341661453,
              0.12123167514801025,
              0.16905248165130615,
              -0.021961525082588196,
              -0.0051623135805130005,
              -0.0890183299779892,
              -0.05860653519630432,
              0.013090595602989197,
              -0.09004518389701843,
              -0.13067343831062317,
              0.10116752982139587,
              0.1702359914779663,
              0.1248389482498169,
              0.015487536787986755,
              0.06791552901268005,
              -0.1489548236131668,
              0.11374366283416748,
              -0.0932941883802414,
              0.10360786318778992,
              -0.0778886005282402,
              0.06328877806663513,
              0.040777504444122314,
              0.07381072640419006,
              -0.12658289074897766,
              -0.11037036776542664,
              -0.024224519729614258,
              0.000623747706413269,
              0.08061563968658447,
              0.003710046410560608,
              -0.15979178249835968,
              0.0705118477344513,
              0.009462401270866394,
              0.013758346438407898,
              0.08094802498817444,
              -0.1816241294145584,
              -0.023430228233337402,
              -0.06152749061584473,
              -0.12651553750038147,
              0.01494993269443512,
              0.021095752716064453,
              0.11955875158309937,
              0.15119659900665283,
              -0.05676020681858063
            ],
            [
              0.016660884022712708,
              -0.14495131373405457,
              0.10061368346214294,
              -0.19333605468273163,
              -0.17847102880477905,
              0.10947000980377197,
              -0.060805127024650574,
              -0.012294262647628784,
              0.13626432418823242,
              -0.17016784846782684,
              0.14881041646003723,
              -0.04542137682437897,
              0.18751609325408936,
              -0.004616260528564453,
              0.04162970185279846,
              0.1448976695537567,
              -0.0795399472117424,
              -0.17371435463428497,
              0.11222332715988159,
              -0.12103788554668427,
              0.14942848682403564,
              0.06587713956832886,
              0.06473073363304138,
              0.11830073595046997,
              -0.0017067044973373413,
              0.07172846794128418,
              0.14983665943145752,
              -0.13053783774375916,
              0.12084874510765076,
              0.15728649497032166,
              0.08745765686035156,
              -0.16826002299785614,
              -0.08304131031036377,
              -0.07796482741832733,
              -0.013338059186935425,
              0.07450553774833679,
              -0.1183018833398819,
              0.19263741374015808,
              0.04975023865699768,
              0.10899293422698975,
              0.18952950835227966,
              -0.1059974655508995,
              -0.19253131747245789,
              0.09254494309425354,
              0.024851873517036438,
              -0.040831342339515686,
              0.10872498154640198,
              0.16569605469703674,
              0.018764466047286987,
              0.0806703269481659,
              0.15322083234786987,
              -0.14579470455646515,
              0.0652330219745636,
              0.06348943710327148,
              -0.16794246435165405,
              0.13015738129615784,
              -0.1917220950126648,
              0.070885568857193,
              0.11301571130752563,
              0.009784534573554993,
              0.08610272407531738,
              0.13725078105926514,
              0.08695024251937866,
              -0.1000838354229927
            ],
            [
              0.0692414939403534,
              -0.1785268932580948,
              -0.16788582503795624,
              0.1277751326560974,
              -0.1427992284297943,
              -0.0001787245273590088,
              0.03920257091522217,
              0.0767047107219696,
              0.01167374849319458,
              0.15497303009033203,
              -0.0605248361825943,
              -0.0789736807346344,
              0.06551465392112732,
              -0.054716140031814575,
              -0.005797743797302246,
              -0.012409642338752747,
              0.1020551323890686,
              -0.08055327832698822,
              0.0943940281867981,
              0.10147473216056824,
              -0.05470035970211029,
              0.056950002908706665,
              -0.12037526071071625,
              -0.1493142992258072,
              -0.026154503226280212,
              -0.09427251666784286,
              0.15314841270446777,
              0.19319400191307068,
              -0.10159062594175339,
              0.18427351117134094,
              0.1381852626800537,
              -0.012921839952468872,
              0.053787171840667725,
              0.018284812569618225,
              0.14617282152175903,
              -0.1641710102558136,
              0.036861956119537354,
              0.08602932095527649,
              0.11045891046524048,
              0.11989781260490417,
              0.12773609161376953,
              -0.17554669082164764,
              0.019745245575904846,
              -0.029144808650016785,
              -0.14660760760307312,
              -0.04740343987941742,
              -0.16402585804462433,
              0.0036511868238449097,
              -0.1894439160823822,
              0.1620849370956421,
              0.09247070550918579,
              -0.08798879384994507,
              0.1902545988559723,
              -0.1583486646413803,
              0.06506842374801636,
              0.0313694030046463,
              -0.0919964537024498,
              0.034327343106269836,
              0.17902296781539917,
              -0.13173127174377441,
              -0.17343835532665253,
              0.04102115333080292,
              -0.049666762351989746,
              -0.1070479154586792
            ],
            [
              0.11594539880752563,
              -0.08518902957439423,
              -0.11601422727108002,
              -0.1373528689146042,
              -0.1763651818037033,
              -0.0899493396282196,
              -0.17478437721729279,
              0.035383015871047974,
              -0.15452490746974945,
              -0.08553631603717804,
              0.12446680665016174,
              0.15075713396072388,
              0.09672102332115173,
              -0.10062037408351898,
              0.10938915610313416,
              0.0191648006439209,
              0.0008954554796218872,
              -0.08454833179712296,
              0.18325626850128174,
              -0.02107621729373932,
              -0.09584653377532959,
              -0.16987992823123932,
              -0.029103398323059082,
              -0.13622957468032837,
              0.11865374445915222,
              -0.050118669867515564,
              0.1088351309299469,
              -0.028222158551216125,
              -0.03224228322505951,
              0.08528810739517212,
              0.1674923300743103,
              0.17274004220962524,
              -0.14952898025512695,
              -0.04154844582080841,
              0.07651841640472412,
              -0.08337844163179398,
              0.11325627565383911,
              0.041487544775009155,
              0.07548639178276062,
              -0.14470338821411133,
              0.13922441005706787,
              0.05347658693790436,
              0.18732067942619324,
              -0.18789677321910858,
              -0.17880436778068542,
              -0.17611360549926758,
              -0.04816769063472748,
              0.0593838095664978,
              -0.05369076132774353,
              -0.051336631178855896,
              0.17762500047683716,
              -0.15832576155662537,
              0.08095762133598328,
              -0.07798611372709274,
              -0.008231520652770996,
              -0.14251480996608734,
              -0.0827689990401268,
              0.10686826705932617,
              0.1886408030986786,
              0.0681954026222229,
              0.053148508071899414,
              -0.059751808643341064,
              0.045214906334877014,
              0.07482460141181946
            ],
            [
              -0.09436000883579254,
              -0.05258911848068237,
              -0.05733895301818848,
              0.08645415306091309,
              -0.1149204671382904,
              0.005579367280006409,
              -0.01804472506046295,
              -0.1802533119916916,
              -0.09919746965169907,
              0.05888688564300537,
              -0.13987968862056732,
              -0.0828419029712677,
              0.1392819881439209,
              0.10679805278778076,
              0.024330109357833862,
              0.03920045495033264,
              -0.010679811239242554,
              0.08751001954078674,
              -0.09657961130142212,
              0.05812197923660278,
              0.08237028121948242,
              0.045818254351615906,
              0.16055479645729065,
              0.05946555733680725,
              0.006513699889183044,
              0.051389217376708984,
              0.02808074653148651,
              0.0012954771518707275,
              0.13225987553596497,
              0.12005460262298584,
              0.19154435396194458,
              -0.11974966526031494,
              0.013307318091392517,
              0.04844914376735687,
              0.09453466534614563,
              -0.15777981281280518,
              0.034186989068984985,
              -0.02187998592853546,
              -0.05516496300697327,
              -0.14525340497493744,
              0.10139939188957214,
              0.17243579030036926,
              -0.028813958168029785,
              -0.046730756759643555,
              -0.19158904254436493,
              -0.08272597193717957,
              0.04222354292869568,
              0.15286758542060852,
              -0.04430624842643738,
              0.05137309432029724,
              -0.18157227337360382,
              -0.01364906132221222,
              0.00024506449699401855,
              -0.0646214634180069,
              0.05116908252239227,
              -0.052579283714294434,
              -0.10365929454565048,
              0.09722912311553955,
              0.18473687767982483,
              -0.11709538102149963,
              -0.0413975715637207,
              0.17799267172813416,
              -0.043090835213661194,
              -0.17955023050308228
            ],
            [
              0.09153309464454651,
              -0.11111212521791458,
              -0.07182072103023529,
              -0.1663578450679779,
              -0.09562218934297562,
              0.16354861855506897,
              -0.11017737537622452,
              -0.04749324917793274,
              -0.12678207457065582,
              -0.06416881084442139,
              0.059277087450027466,
              -0.002577736973762512,
              0.04730658233165741,
              0.04233212769031525,
              -0.08061311393976212,
              -0.08710718899965286,
              0.006587982177734375,
              0.07855626940727234,
              0.04875607788562775,
              -0.0948658436536789,
              -0.044773951172828674,
              -0.11478246748447418,
              0.09455481171607971,
              -0.030138850212097168,
              -0.0019329339265823364,
              -0.03319758176803589,
              -0.024177655577659607,
              0.05296225845813751,
              0.02346867322921753,
              0.16446220874786377,
              0.19014403223991394,
              -0.18355175852775574,
              -0.082379050552845,
              0.08471617102622986,
              0.020261138677597046,
              -0.09478458762168884,
              0.1869475543498993,
              -0.04922156035900116,
              -0.08163978904485703,
              -0.03523845970630646,
              -0.10788528621196747,
              -0.10339012742042542,
              -0.02212861180305481,
              0.13174709677696228,
              -0.1619868278503418,
              -0.08358398824930191,
              0.08678045868873596,
              -0.10419181734323502,
              -0.009287983179092407,
              0.08321240544319153,
              -0.19081781804561615,
              -0.1799527406692505,
              0.09680324792861938,
              -0.02329304814338684,
              -0.059290677309036255,
              0.11201193928718567,
              0.06897041201591492,
              0.02089861035346985,
              0.0408785343170166,
              0.14222261309623718,
              -0.07865220308303833,
              -0.12957575917243958,
              0.04603192210197449,
              0.0016180574893951416
            ],
            [
              -0.04325145483016968,
              -0.12682528793811798,
              0.12624675035476685,
              -0.14423508942127228,
              0.15399691462516785,
              0.1595751941204071,
              0.18722158670425415,
              -0.16718976199626923,
              0.17533069849014282,
              0.10886490345001221,
              -0.18300805985927582,
              -0.0722169503569603,
              0.049868613481521606,
              0.08912700414657593,
              0.01757010817527771,
              -0.17949266731739044,
              -0.02437521517276764,
              -0.12889635562896729,
              0.014169439673423767,
              0.004747658967971802,
              -0.008576184511184692,
              0.16706150770187378,
              -0.10709075629711151,
              0.03893834352493286,
              0.03789588809013367,
              -0.19334468245506287,
              -0.10971729457378387,
              0.1538977324962616,
              0.07917240262031555,
              0.1910010576248169,
              -0.12937131524085999,
              0.12426859140396118,
              0.10788515210151672,
              -0.05774505436420441,
              0.04146021604537964,
              -0.11893144994974136,
              0.10424268245697021,
              -0.06610456109046936,
              0.011901631951332092,
              -0.04062838852405548,
              -0.1594955176115036,
              0.10644647479057312,
              -0.1354171633720398,
              0.12579777836799622,
              0.031874075531959534,
              -0.05361500382423401,
              -0.13014866411685944,
              0.018263161182403564,
              0.1586723029613495,
              0.16345146298408508,
              0.11334344744682312,
              -0.026228368282318115,
              -0.06835019588470459,
              0.008662015199661255,
              -0.1258847713470459,
              -0.03431510925292969,
              -0.0041557252407073975,
              -0.1605418622493744,
              0.02489297091960907,
              0.06359595060348511,
              0.18039634823799133,
              -0.18120232224464417,
              0.11788824200630188,
              -0.17328345775604248
            ],
            [
              0.10913518071174622,
              -0.03603017330169678,
              -0.08467774093151093,
              0.055660679936409,
              -0.02475123107433319,
              0.026516467332839966,
              0.144865483045578,
              -0.08118349313735962,
              -0.049514129757881165,
              -0.15489767491817474,
              0.023231640458106995,
              -0.15916955471038818,
              -0.10683082044124603,
              -0.18372899293899536,
              -0.01681762933731079,
              0.04643988609313965,
              0.050041571259498596,
              -0.04926037788391113,
              0.1011713445186615,
              0.002851426601409912,
              0.18729916214942932,
              -0.0818144902586937,
              -0.07081981003284454,
              -0.08485743403434753,
              -0.030349045991897583,
              -0.1590852588415146,
              0.09302738308906555,
              0.18418514728546143,
              0.01820521056652069,
              -0.027857333421707153,
              -0.10681309551000595,
              0.010719925165176392,
              -0.06204381585121155,
              -0.1597176343202591,
              0.12117376923561096,
              0.02116873860359192,
              0.1739230751991272,
              -0.11444178223609924,
              0.05729198455810547,
              0.1038270890712738,
              -0.13272123038768768,
              0.03619490563869476,
              0.040267422795295715,
              -0.1371314525604248,
              -0.10658963024616241,
              -0.0018140971660614014,
              -0.005943223834037781,
              0.06606048345565796,
              0.15265411138534546,
              -0.10383109748363495,
              0.17890018224716187,
              -0.018766537308692932,
              0.1121869683265686,
              -0.11789748072624207,
              0.01152770221233368,
              -0.054834529757499695,
              -0.1336190402507782,
              -0.001413300633430481,
              0.1458573043346405,
              -0.08298466354608536,
              -0.021178022027015686,
              0.051440462470054626,
              0.13049766421318054,
              0.12237107753753662
            ],
            [
              0.14659076929092407,
              0.19358891248703003,
              0.05141188204288483,
              -0.07005215436220169,
              0.056097209453582764,
              0.10310623049736023,
              -0.047957152128219604,
              0.12483987212181091,
              -0.1739584505558014,
              0.08314025402069092,
              -0.15861940383911133,
              -0.06436637043952942,
              0.18310779333114624,
              0.11287137866020203,
              -0.028511688113212585,
              0.10813972353935242,
              -0.11507527530193329,
              -0.12106743454933167,
              -0.03483562171459198,
              0.05379340052604675,
              -0.10140746831893921,
              -0.1642158478498459,
              -0.12087675929069519,
              -0.12173818796873093,
              0.07272079586982727,
              -0.05182810127735138,
              -0.018130645155906677,
              -0.032540351152420044,
              0.02778807282447815,
              -0.013088375329971313,
              0.17945462465286255,
              -0.00939689576625824,
              0.08424466848373413,
              0.17795345187187195,
              0.15810072422027588,
              0.02043062448501587,
              -0.030702754855155945,
              -0.08234474807977676,
              -0.0922611877322197,
              0.19240126013755798,
              0.1715523600578308,
              -0.009869754314422607,
              0.002211838960647583,
              0.018875867128372192,
              0.018795907497406006,
              -0.15008579194545746,
              0.12467485666275024,
              -0.15216508507728577,
              0.07309335470199585,
              0.16272425651550293,
              0.16357260942459106,
              0.05672895908355713,
              -0.06295773386955261,
              0.1323123574256897,
              -0.16630955040454865,
              -0.07490891218185425,
              -0.027444064617156982,
              0.05465584993362427,
              -0.1483316272497177,
              -0.05319656431674957,
              -0.017922788858413696,
              -0.03917911648750305,
              -0.12923607230186462,
              -0.01582498848438263
            ],
            [
              -0.17053987085819244,
              0.002318352460861206,
              -0.0693201795220375,
              0.06369340419769287,
              -0.05019153654575348,
              -0.16679681837558746,
              -0.14941522479057312,
              -0.025562286376953125,
              -0.18670107424259186,
              0.09355595707893372,
              -0.18742011487483978,
              0.0917326807975769,
              -0.008638784289360046,
              -0.08992653340101242,
              -0.0280131995677948,
              -0.13504204154014587,
              -0.1432550549507141,
              -0.0300358384847641,
              0.016565367579460144,
              -0.12330634146928787,
              0.12102127075195312,
              0.060924530029296875,
              0.146762877702713,
              0.009658679366111755,
              0.12443980574607849,
              -0.12144893407821655,
              -0.06819410622119904,
              -0.10134689509868622,
              -0.10343615710735321,
              -0.07346292585134506,
              -0.05517114698886871,
              -0.16835997998714447,
              -0.14928756654262543,
              -0.0686366856098175,
              0.19073551893234253,
              0.1509144902229309,
              0.15888524055480957,
              0.03213433921337128,
              0.17471471428871155,
              0.05725058913230896,
              -0.1504340022802353,
              -0.1690022498369217,
              -0.15317702293395996,
              0.1532129943370819,
              0.09103211760520935,
              0.18218740820884705,
              -0.06893151998519897,
              -0.12860733270645142,
              0.18258559703826904,
              -0.02773289382457733,
              0.05578118562698364,
              -0.11704865097999573,
              0.06742024421691895,
              0.15301358699798584,
              -0.14428190886974335,
              0.09417703747749329,
              0.003970623016357422,
              -0.03806819021701813,
              -0.06480364501476288,
              -0.17394012212753296,
              -0.1639067828655243,
              -0.11875835806131363,
              -0.06186346709728241,
              -0.038387998938560486
            ],
            [
              0.14707621932029724,
              0.18449482321739197,
              0.1632932424545288,
              -0.07347889989614487,
              -0.07301387935876846,
              -0.042015641927719116,
              0.1485631763935089,
              -0.10639821738004684,
              0.07680296897888184,
              -0.13798774778842926,
              -0.18462902307510376,
              -0.15868473052978516,
              -0.09784530103206635,
              0.06257227063179016,
              -0.008205577731132507,
              0.1753607988357544,
              -0.15353678166866302,
              0.09251996874809265,
